import numpy as np
def toCelsius( f ):
    return (f-32)*(5/9)
#fเป็นอาเรยห์นงึ่มติเิก็บอณุ หภมูใืนหน่วยองศาฟาเรนไฮต์ #คนือาเรยห์นงึ่มติทิเี่ก็บอณุหภมูใินหน่วยองศาเซลเซยีสทไี่ดจ้ากการแปลงแตล่ะอณุหภมูใินf
def BMI( wh ):
    
    return wh[:,0] / (wh[:,1]/100)**2
def distanceTo( p, Points ): #pเป็นอาเรยห์นง่ึมติขินาด2ชอ่งแทนจดุหนง่ึจดุชอ่ง0เก็บพกิัดxชอ่ง1เก็บพกิดัy # Points เป็ นอาเรยส์ องมติ ขิ นาด n2 เก็บพกิ ดั ของจดุ จานวน n จดุ
    return ((Points[:,0]-p[0])**2+(Points[:,1]-p[1])**2)**(0.5)
# คนื อาเรยห์ นงึ่ มติ n ชอ่ ง ทเี่ ก็บระยะทางทวี่ ัดจากจดุ p ถงึ แตล่ ะจดุ ใน Points
# print(toCelsius(np.array([32,212])))
exec(input().strip())